# Dealing with Columns

In [1]:
import pandas as pd

In [2]:
data = {'Id':[1,2,3,4,5],
        'Names':['Ali','Rizwan','Tamoor','Asad','Saleem'],
         'Age':[17,19,20,22,21]}
df = pd.DataFrame(data)

In [3]:
df

   Id   Names  Age
0   1     Ali   17
1   2  Rizwan   19
2   3  Tamoor   20
3   4    Asad   22
4   5  Saleem   21

## Column Selection:
In Order to select a column in Pandas DataFrame, we can either access the columns by calling them by their columns name.

In [5]:
df[['Names','Age']]

    Names  Age
0     Ali   17
1  Rizwan   19
2  Tamoor   20
3    Asad   22
4  Saleem   21

## Column Addition:
In Order to add a column in Pandas DataFrame, we can declare a new list as a column and add to a existing Dataframe.

df['GPA'] = [3,4,3,4,3]

In [6]:
df['GPA'] = [3,4,3,4,3]

In [7]:
df

   Id   Names  Age  GPA
0   1     Ali   17    3
1   2  Rizwan   19    4
2   3  Tamoor   20    3
3   4    Asad   22    4
4   5  Saleem   21    3

# Column Deletion:
In Order to delete a column in Pandas DataFrame, we can use the drop() method. Columns is deleted by dropping columns with column names.

In [8]:
df.drop(columns=['GPA'])

   Id   Names  Age
0   1     Ali   17
1   2  Rizwan   19
2   3  Tamoor   20
3   4    Asad   22
4   5  Saleem   21